jwt_auth/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

jwt_auth/src/Catalogs/Пользователи/ManagerModule.bsl
Функция АктивныеПользователиПоФильтру(Знач Идентификатор, Знач Лимит, Знач Порядок, Знач ПолеСортировки) Экспорт

	Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Наименование КАК Наименование,
	|	Пользователи.Недействителен КАК Недействителен,
	|	Пользователи.Служебный КАК Служебный,
	|	Пользователи.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) <> &Идентификатор
	|	И НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.Служебный
	|	И НЕ Пользователи.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователи.Наименование";
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(Текст);
	
	ЗапросПакета = Схема.ПакетЗапросов[0];
	ОператорВыбрать = ЗапросПакета.Операторы[0];
	ОператорВыбрать.КоличествоПолучаемыхЗаписей = Лимит;

	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
